<?php
// +----------------------------------------------------------------------
// | 数据库设置
// +----------------------------------------------------------------------
return [
    // 数据库类型
    'type'     => 'mysql',
    // 数据库连接DSN配置
    'dsn'      => '',
    // 服务器地址
    'hostname' => '127.0.0.1',
    // 数据库名
    'database' => '',
    // 数据库用户名
    'username' => 'root',
    // 数据库密码
    'password' => '',
    // 数据库名前缀
    'prefix'   => '',
    // 数据库连接端口
    'hostport' => '3306',
    // 数据库编码默认采用utf8
    'charset'  => 'utf8',
];
